
const uniqueId = () => {
    return Math.floor(Math.random() * Date.now()).toString();
  }

function createLecture(week, subject, time, type, day, room, lecturer, subGroup) {
    return {
        id: uniqueId(),
        week,
        subject,
        time,
        type,
        day,
        room,
        lecturer,
        subGroup,
    };
}


//lecture database
const Lectures = [
    createLecture(0,"Направляющие среды инфокоммуникаций", 3, "ЛК", 1, "000", "Нефедов С.Н.", "0"),
    createLecture(0,"Основы статистической электросвязи",4, "ЛК",1,"000","Мельянец Г.И.","0"),
    createLecture(1,"Теория телетрафика",5, "ЛК", 1, "000", "Матковская Т.А.", "0"),
    createLecture(3,"Теория телетрафика",5, "ЛК", 1, "000", "Матковская Т.А.", "0"),
    createLecture(2,"Теория телетрафика",5, "ЛР", 1, "000", "Матковская Т.А.", "1"),
    createLecture(4,"Теория телетрафика",5, "Лекция", 1, "000", "Матковская Т.А.", "2"),
    createLecture(1,"Теория телетрафика",6, "ПЗ", 1, "000", "Матковская Т.А.", "0"),
    createLecture(3,"Теория телетрафика",6, "ПЗ", 1, "000", "Матковская Т.А.", "0"),
    createLecture(2,"Теория телетрафика",6, "ЛР", 1, "000", "Матковская Т.А.", "1"),
    createLecture(4,"Теория телетрафика",6, "Лекция", 1, "000", "Матковская Т.А.", "2"),
    createLecture(1,"Управление персоналом и основы трудового законодательства", 2, "ЛК", 2, "000", "Римарев И.М.", "0"),
    createLecture(3,"Управление персоналом и основы трудового законодательства", 2, "ЛК", 2, "000", "Римарев И.М.", "0"),
    createLecture(2,"Управление персоналом и основы трудового законодательства", 2, "ПЗ", 2, "000", "Римарев И.М.", "0"),
    createLecture(4,"Управление персоналом и основы трудового законодательства", 2, "ПЗ", 2, "000", "Римарев И.М.", "0"),
    createLecture(0,"Сетевые протоколы в инфокоммуникациях", 3, "ЛК", 2, "000", "Дубченок А.О.", "0"),
    createLecture(1,"Сетевые протоколы в инфокоммуникациях", 4, "ПЗ", 2, "000", "Дубченок А.О.", "0"),
    createLecture(3,"Сетевые протоколы в инфокоммуникациях", 4, "ПЗ", 2, "000", "Дубченок А.О.", "0"),
    createLecture(2,"Техническая эксплуатация систем коммутации и передачи", 4, "ПЗ", 2, "000", "Дубченок А.О.", "0"),
    createLecture(4,"Техническая эксплуатация систем коммутации и передачи", 4, "ПЗ", 2, "000", "Дубченок А.О.", "0"),
    createLecture(0,"Техническая эксплуатация систем коммутации и передачи", 5, "ЛК", 2, "000", "Дубченок А.О.", "0"),
    createLecture(0,"Физическая культура", 1, "-", 3, "Спортзал", "Пасичниченко В.А.", "0"),
    createLecture(0,"Системы и сети радиосвязи", 2, "ЛК", 3, "000", "Мельянец Г.И.", "0"),
    createLecture(1,"Системы и сети радиосвязи", 3, "ПЗ", 3, "000", "Мельянец Г.И.", "0"),
    createLecture(3,"Системы и сети радиосвязи", 3, "ПЗ", 3, "000", "Мельянец Г.И.", "0"),
    createLecture(2,"Цифровая обработка речи и изображений", 3, "ЛК", 3, "000", "Киркоров С.И.", "0"),
    createLecture(4,"Цифровая обработка речи и изображений", 3, "ЛК", 3, "000", "Киркоров С.И.", "0"),
    createLecture(1,"Основы статистической электросвязи", 4, "ПЗ", 3, "000", "Мельянец Г.И.", "0"),
    createLecture(3,"Основы статистической электросвязи", 4, "ПЗ", 3, "000", "Мельянец Г.И.", "0"),
    createLecture(2,"Цифровая обработка речи и изображений", 4, "ПЗ", 3, "000", "Киркоров С.И.", "0"),
    createLecture(4,"Цифровая обработка речи и изображений", 4, "ПЗ", 3, "000", "Киркоров С.И.", "0"),
    createLecture(2,"Направляющие среды инфокоммуникаций", 2, "ЛР", 4, "000", "Нефедов С.Н.", "1"),
    createLecture(4,"Направляющие среды инфокоммуникаций", 2, "ЛР", 4, "000", "Нефедов С.Н.", "2"),
    createLecture(1,"Цифровая обработка речи и изображений", 3, "ЛК/ПЗ", 4, "000", "Киркоров С.И.", "0"),
    createLecture(3,"Цифровая обработка речи и изображений", 3, "ЛК/ПЗ", 4, "000", "Киркоров С.И.", "0"),
    createLecture(2,"Направляющие среды инфокоммуникаций", 3, "ЛР", 4, "000", "Нефедов С.Н.", "1"),
    createLecture(4,"Направляющие среды инфокоммуникаций", 3, "ЛР", 4, "000", "Нефедов С.Н.", "2"),
    createLecture(0,"Физическая культура", 4, "-", 4, "Спортзал", "Пасичниченко В.А.", "0"),
    createLecture(0,"Технологии телематики", 5, "ЛК", 4, "000", "Дулькевич А.И.", "0"),
    createLecture(1,"Технологии телематики", 6, "ПЗ", 4, "000", "Дулькевич А.И.", "0"),
    createLecture(1,"Направляющие среды инфокоммуникаций", 2, "ПЗ", 5, "000", "Нефедов С.Н.", "0"),
    createLecture(2, "Теория телетрафика", 2, "ЛК", 5, "000", "Матковская Т.А.", "0"),
    createLecture(4, "Теория телетрафика", 2, "ЛК", 5, "000", "Матковская Т.А.", "0"),
    createLecture(1, "Мультисервисные сети", 3, "ЛК", 5, "000", "Ленковец Е.А.", "0"),
    createLecture(3, "Мультисервисные сети", 3, "ЛК", 5, "000", "Ленковец Е.А.", "0"),
    createLecture(2, "Мультисервисные сети", 3, "ЛР", 5, "000", "Ленковец Е.А.", "1"),
    createLecture(4, "Мультисервисные сети", 3, "ЛР", 5, "000", "Ленковец Е.А.", "2"),
    createLecture(1, "Мультисервисные сети", 4, "ЛК/ПЗ", 5, "000", "Ленковец Е.А.", "0"),
    createLecture(3, "Мультисервисные сети", 4, "ЛК/ПЗ", 5, "000", "Ленковец Е.А.", "0"),
    createLecture(2, "Мультисервисные сети", 4, "ЛР", 5, "000", "Ленковец Е.А.", "1"),
    createLecture(4, "Мультисервисные сети", 4, "ЛР", 5, "000", "Ленковец Е.А.", "2"),
    createLecture(2,"СПвИк/ТЭСКиП", 1, "ЛР", 6, "000", "Дубченок А.О.", "1"),
    createLecture(2,"Системы и сети радиосвязи", 1, "ЛР", 6, "000", "Мельянец Г.И.", "2"),
    createLecture(4,"Системы и сети радиосвязи", 1, "ЛР", 6, "000", "Мельянец Г.И.", "1"),
    createLecture(3,"СПвИк/ТЭСКиП", 1, "ЛР", 6, "000", "Дубченок А.О.", "2"),
    createLecture(2,"СПвИк/ТЭСКиП", 2, "ЛР", 6, "000", "Дубченок А.О.", "1"),
    createLecture(2,"Системы и сети радиосвязи", 2, "ЛР", 6, "000", "Мельянец Г.И.", "2"),
    createLecture(4,"Системы и сети радиосвязи", 2, "ЛР", 6, "000", "Мельянец Г.И.", "1"),
    createLecture(3,"СПвИк/ТЭСКиП", 2, "ЛР", 6, "000", "Дубченок А.О.", "2"),
];

// lectures getter with filtering capability
function getFilteredLectures(filter) {
    return Lectures.filter(lecture =>
        Object.entries(filter).every(([key, value]) => lecture[key] === value)
    );
}

const periods = new Map();
periods.set(1, "08:00 - 09:40");
periods.set(2, "09:55 - 11:35");
periods.set(3, "12:15 - 13:55");
periods.set(4, "14:10 - 15:50");
periods.set(5, "16:20 - 18:00");
periods.set(6, "18:15 - 19:55");

const dayNames = new Map();
dayNames.set(1, "понедельник");
dayNames.set(2, "вторник");
dayNames.set(3, "среда");
dayNames.set(4, "четверг");
dayNames.set(5, "пятница");
dayNames.set(6, "суббота");

/* // Example: Get all lectures for "Week 1" and "Math"
const filteredLectures = getFilteredLectures(lectures, { week: "Week 1", subject: "Math" });
console.log(filteredLectures); */
export { getFilteredLectures, Lectures, periods };