
const uniqueId = () => {
    return Math.floor(Math.random() * Date.now()).toString();
  }

function createLecture(week, subject, time, type, day, room, lecturer, subGroup) {
    return {
        id: uniqueId(),
        week,
        subject,
        time,
        type,
        day,
        room,
        lecturer,
        subGroup,
    };
}


//lecture database
const Lectures = [
    // function createLecture(week: any, subject: any, time: any, type: any, day: any, room: any, lecturer: any, subGroup: any)
    createLecture(0,"Транспортные сети инфокоммуникаций", 1, "ЛК", 1, "428", "Лагутин А.Е.", 0),
    createLecture(0,"Топология инфокоммуникационных сетей", 2, "ЛК", 1, "410", "Лагутин А.Е.", 0),
    createLecture(0,"Надежность инфокоммуникационных систем", 3,"ЛК", 1, "212", "Нефедов С.Н.",0),

    createLecture(1,"Техническая эксплуатация систем коммутации и передачи", 3, "ЛР", 2, "210", "Дубченок А.О.", 1),
    createLecture(3,"Техническая эксплуатация систем коммутации и передачи", 3, "ЛР", 2, "210", "Дубченок А.О.", 2),
    createLecture(2,"Надежность инфокоммуникационных систем", 3, "ПЗ", 2, "428", "Нефедов С.Н.", 0),
    createLecture(4,"Надежность инфокоммуникационных систем", 3, "ПЗ", 2, "428", "Нефедов С.Н.", 0),
    createLecture(0,"Тестирование программного обеспечения инфокоммуникаций", 4, "ЛК", 2, "202", "Ханько А.В.", 0),
    createLecture(2,"Тестирование программного обеспечения инфокоммуникаций", 5, "ЛР", 2, "212", "Ханько А.В.", 1),
    createLecture(2,"Технологии коммутации и маршрутизации", 5, "ЛР", 2, "314", "Рудинская С.Р", 2),
    createLecture(3,"Тестирование программного обеспечения инфокоммуникаций", 5, "ЛК", 2, "212", "Ханько А.В.", 0),
    createLecture(4,"Технологии коммутации и маршрутизации", 5, "ЛР", 2, "314", "Рудинская С.Р", 1),
    createLecture(4,"Тестирование программного обеспечения инфокоммуникаций", 5, "ЛР", 2, "212", "Ханько А.В.", 2),
    createLecture(2,"Тестирование программного обеспечения инфокоммуникаций", 6, "ЛР", 2, "212", "Ханько А.В.", 1),
    createLecture(2,"Технологии коммутации и маршрутизации", 6, "ЛР", 2, "314", "Рудинская С.Р", 2),
    createLecture(4,"Технологии коммутации и маршрутизации", 6, "ЛР", 2, "314", "Рудинская С.Р", 1),
    createLecture(4,"Тестирование программного обеспечения инфокоммуникаций", 6, "ЛР", 2, "212", "Ханько А.В.", 2),

    createLecture(2,"Топология инфокоммуникационных сетей", 3, "ПЗ", 3, "218", "Лагутин А.Е", 0),
    createLecture(4,"Топология инфокоммуникационных сетей", 3, "ПЗ", 3, "218", "Лагутин А.Е.", 0),
    createLecture(1,"Основы предпринимательской деятельности и управление проектами", 4, "ЛК", 3, "202", "Длусская В.В.", 0),
    createLecture(3,"Основы предпринимательской деятельности и управление проектами", 4, "ЛК", 3, "202", "Длусская В.В.", 0),
    createLecture(2,"Топология инфокоммуникационных сетей", 4, "ПЗ", 3, "222", "Лагутин А.Е.", 0),
    createLecture(4,"Топология инфокоммуникационных сетей", 4, "ПЗ", 3, "222", "Лагутин А.Е.", 0),
    createLecture(0,"Техническая эксплуатация систем коммутации и передачи", 5, "ЛК", 3, "202", "Дубченок А.О.", 0),
    createLecture(1,"Техническая эксплуатация систем коммутации и передачи", 6, "ПЗ", 3, "202", "Дубченок А.О.", 0),
    createLecture(3,"Техническая эксплуатация систем коммутации и передачи", 6, "ПЗ", 3, "202", "Дубченок А.О.", 0),

    createLecture(2,"Основы предпринимательской деятельности и управление проектами", 1, "ЛК", 4, "406", "Длусская В.В.", 0),
    createLecture(4,"Основы предпринимательской деятельности и управление проектами", 1, "ЛК", 4, "406", "Длусская В.В.", 0),
    createLecture(1,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 2, "ПЗ", 4, "406", "Барташевич В.В.", 0),
    createLecture(3,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 2, "ПЗ", 4, "406", "Барташевич В.В.", 0),
    createLecture(2,"Метрология, стандартизация и сертификация в телекоммуникациях", 2, "ЛК", 4, "106", "Киевец Н.Г.", 0),
    createLecture(4,"Метрология, стандартизация и сертификация в телекоммуникациях", 2, "ЛК", 4, "106", "Киевец Н.Г.", 0),
    createLecture(1,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 3, "ЛК", 4, "406", "Кравченко Ю.Р.", 0),
    createLecture(3,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 3, "ЛК", 4, "406", "Кравченко Ю.Р.", 0),
    createLecture(2,"Метрология, стандартизация и сертификация в телекоммуникациях", 3, "ПЗ", 4, "106", "Киевец Н.Г.", 0),
    createLecture(4,"Метрология, стандартизация и сертификация в телекоммуникациях", 3, "ПЗ", 4, "106", "Киевец Н.Г.", 0),
    createLecture(1,"Транспортные сети инфокоммуникаций", 4, "ЛР", 4, "210", "Лагутин А.Е.", 1),
    createLecture(3,"Транспортные сети инфокоммуникаций", 4, "ЛР", 4, "210", "Лагутин А.Е.", 2),
    createLecture(2,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 4, "ЛК", 4, "202", "Кравченко Ю.Р.", 0),
    createLecture(4,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 4, "ЛК", 4, "202", "Кравченко Ю.Р.", 0),
    createLecture(1,"Транспортные сети инфокоммуникаций", 5, "ЛР", 4, "210", "Лагутин А.Е.", 1),
    createLecture(3,"Транспортные сети инфокоммуникаций", 5, "ЛР", 4, "210", "Лагутин А.Е.", 2),

    createLecture(1,"Метрология, стандартизация и сертификация в телекоммуникациях", 2, "ЛР", 5, "410", "Киевец Н.Г.", 1),
    createLecture(3,"Метрология, стандартизация и сертификация в телекоммуникациях", 2, "ЛР", 5, "410", "Киевец Н.Г.", 2),
    createLecture(1,"Метрология, стандартизация и сертификация в телекоммуникациях", 3, "ЛР", 5, "410", "Киевец Н.Г.", 1),
    createLecture(3,"Метрология, стандартизация и сертификация в телекоммуникациях", 3, "ЛР", 5, "410", "Киевец Н.Г.", 2),
    createLecture(1,"Технологии коммутации и маршрутизации", 4, "ЛК", 5, "106", "Рудинская С.Р.", 0),
    createLecture(3,"Технологии коммутации и маршрутизации", 4, "ЛК", 5, "106", "Рудинская С.Р.", 0),
    createLecture(2,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 4, "ПЗ", 5, "406", "Барташевич В.В.", 0),
    createLecture(4,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 4, "ПЗ", 5, "406", "Барташевич В.В.", 0),
    createLecture(1,"Технологии коммутации и маршрутизации", 5, "ПЗ", 5, "106", "Рудинская С.Р.", 0),
    createLecture(3,"Технологии коммутации и маршрутизации", 5, "ПЗ", 5, "106", "Рудинская С.Р.", 0),
    createLecture(2,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 5, "ПЗ", 5, "406", "Барташевич В.В.", 0),
    createLecture(4,"Основы бизнеса и права в сфере инфокоммуникационных технологий", 5, "ПЗ", 5, "406", "Барташевич В.В.", 0),
    createLecture(2,"Технологии коммутации и маршрутизации", 6, "ЛК", 5, "244", "Рудинская С.Р.", 0),
    createLecture(4,"Технологии коммутации и маршрутизации", 6, "ЛК", 5, "244", "Рудинская С.Р.", 0),

    createLecture(1,"Основы предпринимательской деятельности и управление проектами", 1, "ПЗ", 6, "430", "Длусская В.В.", 0),
    createLecture(3,"Основы предпринимательской деятельности и управление проектами", 1, "ПЗ", 6, "430", "Длусская В.В.", 0),
    createLecture(1,"Основы предпринимательской деятельности и управление проектами", 2, "ПЗ", 6, "430", "Длусская В.В.", 0),
    createLecture(3,"Основы предпринимательской деятельности и управление проектами", 2, "ПЗ", 6, "430", "Длусская В.В.", 0),
    createLecture(2,"Надежность инфокоммуникационных систем", 2, "ЛР", 6, "-", "Нефедов С.Н.", 2),
    createLecture(4,"Надежность инфокоммуникационных систем", 2, "ЛР", 6, "-", "Нефедов С.Н.", 1),
    createLecture(2,"Надежность инфокоммуникационных систем", 3, "ЛР", 6, "-", "Нефедов С.Н.", 2),
    createLecture(4,"Надежность инфокоммуникационных систем", 3, "ЛР", 6, "-", "Нефедов С.Н.", 1),
];

function getFilteredLectures(filter) {
    return Lectures.filter(lecture => {
        return Object.entries(filter).every(([key, value]) => {
            if ((key === 'week' || key === 'subGroup') && lecture[key] === 0) {
                return true; // Include lectures with week or subGroup value of 0
            }
            return lecture[key] === value;
        });
    });
}


const periods = new Map();
periods.set(1, "08:00 - 09:40");
periods.set(2, "09:55 - 11:35");
periods.set(3, "12:15 - 13:55");
periods.set(4, "14:10 - 15:50");
periods.set(5, "16:20 - 18:00");
periods.set(6, "18:15 - 19:55");

const dayNames = new Map();
dayNames.set(1, "понедельник");
dayNames.set(2, "вторник");
dayNames.set(3, "среда");
dayNames.set(4, "четверг");
dayNames.set(5, "пятница");
dayNames.set(6, "суббота");
dayNames.set(0, "воскресенье");

const monthNames = new Map();
monthNames.set(0, "января");
monthNames.set(1, "февраля");
monthNames.set(2, "марта");
monthNames.set(3, "апреля");
monthNames.set(4, "мая");
monthNames.set(5, "июня");
monthNames.set(6, "июля");
monthNames.set(7, "августа");
monthNames.set(8, "сентября");
monthNames.set(9, "октября");
monthNames.set(10, "ноября");
monthNames.set(11, "декабря");


/* // Example: Get all lectures for "Week 1" and "Math"
const filteredLectures = getFilteredLectures(lectures, { week: "Week 1", subject: "Math" });
console.log(filteredLectures); */
export { getFilteredLectures, dayNames, periods, monthNames };